benchmark_results_replicated/20260423_101844/analysis/rep24/run/go_c200/wrk_output.txt
Running 1m test @ http://localhost:8080/days-since
  4 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    46.61ms   41.81ms 404.33ms   44.91%
    Req/Sec     1.19k   181.25     1.77k    66.99%
  Latency Distribution
     50%   49.34ms
     75%   89.64ms
     90%   96.68ms
     99%  163.09ms
  285311 requests in 1.00m, 34.83MB read
Requests/sec:   4754.07
Transfer/sec:    594.26KB
P95: 100765
P99: 163089